Revit 2026 API

# ModelCurveNode Properties

---

The ModelCurveNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode) |
|  | LineProperties | Access to the line (pen) properties of the curve being drawn |
|  | NodeName | A readable name of the output node. (Inherited from RenderNode) |

#### Reference

ModelCurveNode Class

Autodesk.Revit.DB Namespace